Revit 2027 API
RoomTag.RoomTagType Property
The tag type.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoomTagType RoomTagType { get; set; }
Public Property RoomTagType As RoomTagType
	Get
	Set
public:
property RoomTagType^ RoomTagType {
	RoomTagType^ get ();
	void set (RoomTagType^ value);
}
member RoomTagType : RoomTagType with get, set
Property Value
RoomTagType
See Also
Reference
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace